f=[-0.9,-1.4,-1.9,-0.45,-0.95,-1.45,0.05,-0.45,-0.95];    %目标函数系数
A=[-0.4,0.6,0.6,0,0,0,0,0,0;
    -0.2,-0.2,0.8,0,0,0,0,0,0;
    0,0,0,-0.85,0.15,0.15,0,0,0;
    0,0,0,-0.6,-0.6,0.4,0,0,0;
    0,0,0,0,0,0,-0.5,-0.5,0.5;
    1,0,0,1,0,0,1,0,0;
    0,1,0,0,1,0,0,1,0;
    0,0,1,0,0,1,0,0,1]; %约束不等式系数矩阵(转化为小于等于形式)
b=[0,0,0,0,0,2000,2500,1200];    %约束不等式对应的右端常数
aeq=[];                         %约束等式系数矩阵
beq=[];                         %约束等式右端常数
lb=[0,0,0,0,0,0,0,0,0];               %变量的最小取值限制
[x,fval]=linprog(f,A,b,aeq,beq,lb); %函数linprog:用单纯型法求解线性规划问题，参数意义与前面所述一致
disp('x=');     %最终各变量取值，即一个最优解
disp(x);
disp('fval=');  %目标函数最优值
disp(fval);